public class Main {
    public static void main(String[] args) {
        System.out.println("Дз-5. Задание 1.");

        // Задание 1.
        int clientOs = 5;
        if (clientOs == 0) {
            System.out.println("Установите версию приложения для iOS по ссылке"); }
        else if (clientOs == 1) {
            System.out.println("Установите версию приложения для Android по ссылке"); }
        else {
            System.out.println("Для данной ОС у нас пока нет мобильного приложения"); }

        //Задание 2.

    }
}
